Documents/ВыполнитьОтгрузку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Document>
		<Properties>
			<Name>ВыполнитьОтгрузку</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.СебестоимостьНоменклатуры</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиМатериалов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОтгрузкуВыполнил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокОтгружаемойНоменклатуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокГотовойНоменклатуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ОстаткиМатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиМатериалов</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/СебестоимостьНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<AccumulationRegister>
		<Properties>
			<Name>СебестоимостьНоменклатуры</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ВыполнитьОтгрузку/Ext/ObjectModule.bsl
// переменные для записи себестоимости
Перем РеализованныйПродкут;
Перем КоличествоПродукции;

Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр ОстаткиМатериалов Приход
	Движения.ОстаткиМатериалов.Записывать = Истина;
	Для Каждого ТекСтрокаСписокГотовойНоменклатуры Из СписокГотовойНоменклатуры Цикл
		Движение = Движения.ОстаткиМатериалов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаСписокГотовойНоменклатуры.Номенклатура;
		Движение.Склад = Справочники.Склады.Основной;
		Движение.Количество = ТекСтрокаСписокГотовойНоменклатуры.Количество;
		
		РеализованныйПродкут = ТекСтрокаСписокГотовойНоменклатуры.Номенклатура;
		КоличествоПродукции = ТекСтрокаСписокГотовойНоменклатуры.Количество;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СебестоимостьНоменклатурыОстатки.Номенклатура КАК Номенклатура,
	|	СебестоимостьНоменклатурыОстатки.СуммаОстаток КАК СуммаОстаток,
	|	СебестоимостьНоменклатурыОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.СебестоимостьНоменклатуры.Остатки(
	|			&МоментВремени,
	|			Номенклатура В
	|				(ВЫБРАТЬ
	|					ВыполнитьОтгрузкуСписокОтгружаемойНоменклатуры.Номенклатура КАК Номенклатура
	|				ИЗ
	|					Документ.ВыполнитьОтгрузку.СписокОтгружаемойНоменклатуры КАК ВыполнитьОтгрузкуСписокОтгружаемойНоменклатуры
	|				ГДЕ
	|					ВыполнитьОтгрузкуСписокОтгружаемойНоменклатуры.Ссылка = &Ссылка)) КАК СебестоимостьНоменклатурыОстатки";
	
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	МассивОстатков = Запрос.Выполнить().Выгрузить();
	
	ОбщаяСебестоимостьИзготовления = 0;
	
	// регистр ОстаткиМатериалов Расход
	Движения.ОстаткиМатериалов.Записывать = Истина;
	Для Каждого ТекСтрокаСписокОтгружаемойНоменклатуры Из СписокОтгружаемойНоменклатуры Цикл
		Движение = Движения.ОстаткиМатериалов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаСписокОтгружаемойНоменклатуры.Номенклатура;
		Движение.Склад = Справочники.Склады.Основной;
		Движение.Количество = ТекСтрокаСписокОтгружаемойНоменклатуры.Количество;
		
		// расчет себестоимости производства одной единицы продукции.
		Для Каждого СтрокаТЧ ИЗ МассивОстатков Цикл
			Если СтрокаТЧ.Номенклатура = ТекСтрокаСписокОтгружаемойНоменклатуры.Номенклатура Тогда 
				СебестоимостьИзготовленияЕдиницыПродукта = СтрокаТЧ.СуммаОстаток/СтрокаТЧ.КоличествоОстаток;
			КонецЕсли;
		КонецЦикла;
		
		СебестоимостьИзготовленияПоОдномуМатериалу = СебестоимостьИзготовленияЕдиницыПродукта * ТекСтрокаСписокОтгружаемойНоменклатуры.Количество;
		ОбщаяСебестоимостьИзготовления = ОбщаяСебестоимостьИзготовления + СебестоимостьИзготовленияПоОдномуМатериалу;		
	КонецЦикла;
	
	// регистр СебестоимостьНоменклатуры Приход
	Движения.СебестоимостьНоменклатуры.Записывать = Истина;
	
	Движение = Движения.СебестоимостьНоменклатуры.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Номенклатура = РеализованныйПродкут;
	Движение.Количество = КоличествоПродукции;
	Движение.Сумма = ОбщаяСебестоимостьИзготовления;
	
	Движения.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОстаткиМатериаловОстатки.Номенклатура КАК Номенклатура,
	|	ОстаткиМатериаловОстатки.Склад КАК Склад,
	|	-ОстаткиМатериаловОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.ОстаткиМатериалов.Остатки(, ) КАК ОстаткиМатериаловОстатки
	|ГДЕ
	|	ОстаткиМатериаловОстатки.Склад = &Склад
	|	И ОстаткиМатериаловОстатки.КоличествоОстаток < 0";
	
	Запрос.УстановитьПараметр("Склад", Справочники.Склады.Основной);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Отказ = Истина;
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Сообщить("Передача невозможна, не хватает позиций по номенклатуре " + ВыборкаДетальныеЗаписи.Номенклатура + " на складе " + ВыборкаДетальныеЗаписи.Склад + " в количестве " + ВыборкаДетальныеЗаписи.КоличествоОстаток);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры
